{
  "backend/main.mo": "Motoko actor implementing order management and stock tracking with functions for placing orders, completing orders, managing stock items, and querying order/stock status using Map-based storage.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including customer/seller authentication, order forms, seller dashboard, and stock management with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, authentication, order management, stock status, and UI components with their specific responsibilities.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining light and dark theme variables for backgrounds, foregrounds, borders, and component states.",
  "frontend/index.html": "HTML entry point for the StickSmart application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, customer login/order, seller login/signup/dashboard/stock pages, wrapped in theme and auth providers.",
  "frontend/src/components/CustomerLayout.tsx": "Layout wrapper for customer pages with header, StickSmart branding, Internet Identity logout button, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/OrderListItem.tsx": "Table row component displaying individual order details with checkbox for completion toggle, formatted timestamp, and visual styling for completed orders.",
  "frontend/src/components/SellerLayout.tsx": "Layout wrapper for seller pages with header, navigation buttons for dashboard and stock management, email display, logout functionality, and footer.",
  "frontend/src/components/StockStatusIndicator.tsx": "React component that displays stock availability status with three states: loading (spinner), out of stock (red alert), and in stock (green checkmark).",
  "frontend/src/contexts/SellerAuthContext.tsx": "Context provider for seller authentication using localStorage with SHA-256 password hashing, supporting login, signup, and logout operations.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCompleteOrder.ts": "React Query mutation hook for completing orders via the backend actor, invalidating the orders cache on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity delegation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useOrders.ts": "React Query mutation hook for placing orders with products, quantity, and room number, invalidating orders cache on success.",
  "frontend/src/hooks/useSellerAuth.ts": "Simple hook that provides access to the SellerAuthContext with error handling for missing provider.",
  "frontend/src/hooks/useSellerOrders.ts": "React Query hook that fetches all current orders from the backend actor, sorted by timestamp descending, with 10-second polling interval.",
  "frontend/src/hooks/useStockManagement.ts": "React Query mutation hook for adding or updating stock items via the backend actor, invalidating stock status cache on success.",
  "frontend/src/hooks/useStockStatus.ts": "React Query hook that fetches stock status for a specific product ID with 5-second polling interval.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using HSL color values for a warm amber/orange color scheme.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/CustomerLogin.tsx": "Customer login page using Internet Identity authentication, redirecting to order form on successful login with loading states.",
  "frontend/src/pages/CustomerOrderForm.tsx": "Customer order form page for placing stick orders with quantity selection, room number input, stock status checking, and order submission with validation.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with two portal cards (Customer and Seller) that navigate to their respective login pages. Features a gradient background with amber/orange theme and displays key features for each portal type.",
  "frontend/src/pages/SellerDashboard.tsx": "Seller dashboard displaying order statistics (total, pending, completed) and a table of all orders with real-time updates. Requires authentication and uses custom hooks for seller auth and order management.",
  "frontend/src/pages/SellerLogin.tsx": "Seller login form with email/password authentication, validation, and navigation to dashboard on success. Includes link to signup page and redirects authenticated users automatically.",
  "frontend/src/pages/SellerSignup.tsx": "Seller registration form with email, password, and password confirmation fields. Validates password length (min 6 chars) and matching passwords before creating account.",
  "frontend/src/pages/SellerStockManagement.tsx": "Stock management page with a toggle switch to control product availability for customers. Uses hooks to fetch and update stock status with optimistic UI updates and toast notifications.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for StickSmart, a stick-ordering website with customer/seller portals, order management, and stock control. Tracks 7 implemented features including dual authentication, order forms, seller dashboard, and stock management with a warm earthy design theme."
}