{
  "backend/main.mo": "Main backend actor implementing user profile management and room service ordering system with access control, including order placement, stock validation, order retrieval, and admin functions for managing orders and stock.",
  "feature_evidence.json": "Feature evidence report documenting the backend order management system feature with references to frontend components, dependencies, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React files including pages, components, hooks, and configuration files for the StickSmart application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette defining light and dark theme variables for a warm earthy design system.",
  "frontend/index.html": "HTML entry point for the StickSmart application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for customer and seller portals, wrapped in ThemeProvider with Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page component displaying an access denied message with shield icon and home navigation button for unauthorized users.",
  "frontend/src/components/CustomerLayout.tsx": "Layout wrapper for customer pages with header showing user profile name, logout button with cache clearing, and footer with caffeine.ai attribution.",
  "frontend/src/components/OrderListItem.tsx": "Table row component rendering individual order details with completion checkbox, quantity, room number, timestamp, and customer name fetched from profile with principal fallback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name (required) and room number (optional) with form validation and submission via useSaveCallerUserProfile hook.",
  "frontend/src/components/SellerLayout.tsx": "Layout wrapper for seller pages with header, navigation (Dashboard/Stock Management), logout functionality, and footer with branding.",
  "frontend/src/components/StockStatusIndicator.tsx": "Visual indicator component displaying loading, in-stock, or out-of-stock status with appropriate icons and styling.",
  "frontend/src/contexts/SellerAuthContext.tsx": "Empty file, no implementation present.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, handling identity changes and invalidating dependent queries on actor updates.",
  "frontend/src/hooks/useAdminCheck.ts": "Hook that queries whether the current caller has admin privileges via the backend actor.",
  "frontend/src/hooks/useCompleteOrder.ts": "Mutation hook for completing orders by ID, invalidating the orders query cache on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useOrders.ts": "Mutation hook for placing orders with products, quantity, and room number, invalidating orders cache on success.",
  "frontend/src/hooks/useSellerAuth.ts": "Empty file, no implementation present.",
  "frontend/src/hooks/useSellerOrders.ts": "Query hook that fetches all current orders sorted by timestamp, with automatic 10-second refetch interval.",
  "frontend/src/hooks/useStockManagement.ts": "Mutation hook for adding or updating stock items with product and availability status, invalidating stock status cache on success.",
  "frontend/src/hooks/useStockStatus.ts": "Query hook that checks stock availability for a specific product ID with 5-second polling interval.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching the current user's profile and saving/updating profile data (name and room number).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CustomerLogin.tsx": "Customer login page that authenticates users via Internet Identity, checks for user profile, and redirects to order form or shows profile setup modal if needed.",
  "frontend/src/pages/CustomerOrderForm.tsx": "Customer order form page where authenticated users can select stick quantity, enter room number, view stock status, and place orders with real-time validation and feedback.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that displays customer and seller portal options, automatically redirects authenticated users based on their role (admin to seller dashboard, regular users to customer order page).",
  "frontend/src/pages/SellerDashboard.tsx": "Seller dashboard page that displays order statistics and a table of all orders (pending and completed), restricted to admin users with access control checks.",
  "frontend/src/pages/SellerLogin.tsx": "Seller login page that authenticates users via Internet Identity, verifies admin status, and redirects to dashboard or shows access denied screen for non-admin users.",
  "frontend/src/pages/SellerSignup.tsx": "Empty file with no content.",
  "frontend/src/pages/SellerStockManagement.tsx": "Seller stock management page where admin users can toggle product availability status (in stock/out of stock) using a switch control with real-time updates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for StickSmart application documenting implemented features including dual authentication (Internet Identity for customers, email/password for sellers), order management, stock control, and UI design with earthy color theme."
}