{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Initial StickSmart Build - Complete Order Management System",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Integrate authorization component for user authentication and role-based access control",
      "acceptanceCriteria": [
        "Users must log in with Internet Identity before accessing any application data",
        "First-time users are prompted to create a user profile with their name",
        "User profile is displayed instead of principal ID throughout the application",
        "Cached application data is cleared on logout",
        "Profile setup modal does not flash during initial load"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "create",
          "description": "Create hook for managing user profiles with getCallerUserProfile and saveCallerUserProfile queries/mutations. Implement proper loading state handling to prevent profile setup modal flash as specified in authorization component usage instructions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "create",
          "description": "Create modal component for first-time user profile setup that collects user name and room number. Show only when isAuthenticated && !profileLoading && isFetched && userProfile === null. Use the authorization component to support profile creation functionality."
        },
        {
          "path": "frontend/src/pages/CustomerLogin.tsx",
          "operation": "modify",
          "description": "Update customer login flow to check for existing user profile after Internet Identity authentication. If no profile exists, show ProfileSetupModal before allowing access to order form. Clear cached data on logout using queryClient.clear()."
        },
        {
          "path": "frontend/src/pages/CustomerOrderForm.tsx",
          "operation": "modify",
          "description": "Update to require authenticated user with valid profile. Display user name from profile instead of principal ID. Ensure authorization checks are in place before allowing order placement."
        },
        {
          "path": "frontend/src/components/CustomerLayout.tsx",
          "operation": "modify",
          "description": "Update logout functionality to clear all cached application data using queryClient.clear() after calling clear(). Display user name from profile in header instead of email placeholder."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enhance seller authentication with authorization component integration",
      "acceptanceCriteria": [
        "Seller authentication uses Internet Identity instead of local storage",
        "Admin role is properly assigned and checked for seller operations",
        "Unauthorized users cannot access seller dashboard or stock management",
        "Authorization errors from backend are handled gracefully with user-friendly messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/SellerAuthContext.tsx",
          "operation": "modify",
          "description": "Replace localStorage-based seller authentication with Internet Identity and authorization component. Implement role checking using getCallerUserRole and isCallerAdmin backend capabilities. Add error handling for authorization failures."
        },
        {
          "path": "frontend/src/pages/SellerLogin.tsx",
          "operation": "modify",
          "description": "Update to use Internet Identity authentication instead of email/password form. After successful login, verify user has admin role before allowing dashboard access. Show AccessDeniedScreen for non-admin users."
        },
        {
          "path": "frontend/src/pages/SellerSignup.tsx",
          "operation": "modify",
          "description": "Replace email/password signup with Internet Identity login flow. After authentication, check if user has admin privileges. If not, display message that admin access must be granted."
        },
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Create component to display when unauthorized users attempt to access seller/admin areas. Show clear message about admin-only access and provide navigation back to customer portal."
        },
        {
          "path": "frontend/src/pages/SellerDashboard.tsx",
          "operation": "modify",
          "description": "Add admin authorization check using authorization component. Show AccessDeniedScreen if user is not admin. Handle backend authorization errors gracefully with toast notifications."
        },
        {
          "path": "frontend/src/pages/SellerStockManagement.tsx",
          "operation": "modify",
          "description": "Add admin authorization check using authorization component. Show AccessDeniedScreen if user is not admin. Handle backend authorization trap errors with user-friendly error messages."
        },
        {
          "path": "frontend/src/components/SellerLayout.tsx",
          "operation": "modify",
          "description": "Update to use Internet Identity logout and display admin user profile name. Remove email display and replace with profile name. Ensure logout clears all cached data."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Maintain existing warm, earthy color theme throughout authorization integration",
      "acceptanceCriteria": [
        "All new components use the existing terracotta, amber, and sage green color palette",
        "Color theme consistency is maintained across login, profile setup, and authorization UI elements",
        "Dark mode support is preserved where applicable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure existing warm, earthy color theme variables (terracotta, amber, sage green) are properly applied to new authorization-related components. Add any missing CSS variables needed for profile setup modal and access denied screen while maintaining color consistency."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Apply existing warm color theme from index.css to modal styling. Use terracotta/amber accent colors for buttons and sage green for success states."
        },
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Style component using existing warm, earthy color palette. Use appropriate amber/terracotta colors for alert states while maintaining visual consistency with rest of application."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update order management flow to work with authenticated users and profiles",
      "acceptanceCriteria": [
        "Orders are associated with authenticated user principals",
        "Room numbers are pre-filled from user profiles when available",
        "Order history shows user names instead of principal IDs",
        "Completed orders display correctly in seller dashboard with user information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CustomerOrderForm.tsx",
          "operation": "modify",
          "description": "Pre-fill room number input from user profile if available. Associate orders with authenticated user principal. Update validation to work with profile-based user data."
        },
        {
          "path": "frontend/src/hooks/useOrders.ts",
          "operation": "modify",
          "description": "Ensure placeOrder mutation uses authenticated principal from actor context. Handle authorization errors gracefully."
        },
        {
          "path": "frontend/src/components/OrderListItem.tsx",
          "operation": "modify",
          "description": "Update to display user names from profiles instead of raw principal IDs. Add loading states for profile lookups if needed. Handle cases where profile may not exist gracefully."
        },
        {
          "path": "frontend/src/pages/SellerDashboard.tsx",
          "operation": "modify",
          "description": "Update order display to show user names from profiles. Ensure admin authorization is checked before displaying orders. Add error handling for authorization failures."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Enhance routing to support authenticated flows and access control",
      "acceptanceCriteria": [
        "Unauthenticated users are redirected to login when accessing protected routes",
        "Non-admin users cannot access seller routes",
        "Profile setup is required before accessing customer order form",
        "Navigation flows work correctly after login and profile setup"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route guards for authenticated routes. Ensure customer routes require Internet Identity authentication and valid profile. Ensure seller routes require admin role. Handle redirects for unauthorized access appropriately."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update navigation logic to check authentication state and role before routing to seller or customer portals. Redirect already-authenticated users appropriately based on their role."
        }
      ]
    }
  ]
}